TestEDT/src/InformationRegisters/уа_НастройкаЕПССчетаЦБ/уа_НастройкаЕПССчетаЦБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уа_НастройкаЕПССчетаЦБ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>ПереоценкаПоложительная</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>ПереоценкаОтрицательная</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>КорректировкаУвеличение</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>КорректировкаУменьшение</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>РезервыПодОбесценение</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>УчетДочерних</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>БезПрекращенияПризнания</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>ПереоценкаПоложительнаяПереданные</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>ПереоценкаОтрицательнаяПереданные</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>КорректировкаУвеличениеПереданные</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>КорректировкаУменьшениеПереданные</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>РезервыПодОбесценениеПереданные</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <resources>
    <name>ВыбытиеРеализацияЦБ</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияАктива</name>
    <type>
      <types>EnumRef.уа_КатегорииАктива</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлассификацияЦБ</name>
    <type>
      <types>EnumRef.уа_КлассификацияЦБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОценочнаяКатегория</name>
    <type>
      <types>EnumRef.уа_ОценочнаяКатегория</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/InformationRegisters/уа_НастройкаЕПССчетаЦБ/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КатегорияАктиваПриИзменении(Элемент)
	ОбработатьИзменениеКатегорииЦБ();
КонецПроцедуры

#КонецОбласти


#Область СерверныеОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ОбработатьИзменениеКатегорииЦБ()
	
	УправлениеФормой();
	
	Если Элементы.КлассификацияЦБ.ПараметрыВыбора.Количество() > 0 И
		ВРег(Элементы.КлассификацияЦБ.ПараметрыВыбора[0].Имя) = ВРег("Отбор.Ссылка") Тогда
		
		Значение = Элементы.КлассификацияЦБ.ПараметрыВыбора[0].Значение;
		Если Значение.Найти(Запись.КлассификацияЦБ) = Неопределено Тогда
			Запись.КлассификацияЦБ = Неопределено;
		КонецЕсли;
	Иначе
		Запись.КлассификацияЦБ = Неопределено;
	КонецЕсли;
	
	Если Элементы.ОценочнаяКатегория.ПараметрыВыбора.Количество() > 0 И
		ВРег(Элементы.ОценочнаяКатегория.ПараметрыВыбора[0].Имя) = ВРег("Отбор.Ссылка") Тогда
		
		Значение = Элементы.ОценочнаяКатегория.ПараметрыВыбора[0].Значение;
		Если Значение.Найти(Запись.ОценочнаяКатегория) = Неопределено Тогда
			Запись.ОценочнаяКатегория = Неопределено;
		КонецЕсли;
	Иначе
		Запись.ОценочнаяКатегория = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Прочее

&НаСервере
Процедура УправлениеФормой()
	
	// Отбор классификаций ЦБ
	ОтборПоСсылке = Новый ПараметрВыбора("Отбор.Ссылка", 
		Перечисления.уа_КлассификацияЦБ.КлассификацииПоКатегорииЦБ(Запись.КатегорияАктива));
	
	ПараметрыВыбораКлассификации = Новый Массив;
	ПараметрыВыбораКлассификации.Добавить(ОтборПоСсылке);
	
	Элементы.КлассификацияЦБ.ПараметрыВыбора = 
		Новый ФиксированныйМассив(ПараметрыВыбораКлассификации);
	
	// Отбор оценочных категорий
	ОтборПоСсылке = Новый ПараметрВыбора("Отбор.Ссылка", 
		Перечисления.уа_ОценочнаяКатегория.ОценочныеКатегорииПоКатегорииЦБ(Запись.КатегорияАктива));
	
	ПараметрыВыбораОценочнойКатегории = Новый Массив;
	ПараметрыВыбораОценочнойКатегории.Добавить(ОтборПоСсылке);
	
	Элементы.ОценочнаяКатегория.ПараметрыВыбора = 
		Новый ФиксированныйМассив(ПараметрыВыбораОценочнойКатегории);
	
КонецПроцедуры


#КонецОбласти
